System.register("chunks:///_virtual/co_bubble_des.ts", ["cc"], (function(d) {
  "use strict";
  var e;
  return {
    setters: [function(d) {
      e = d.cclegacy
    }],
    execute: function() {
      e._RF.push({}, "aefbeU44PFE15GONHIciQdL", "co_bubble_des", void 0);
      d("co_bubble_des", {
        k1: {
          id: 1,
          des: "好想睡会儿",
          dep_id: 0
        },
        k2: {
          id: 2,
          des: "任务好多",
          dep_id: 0
        },
        k3: {
          id: 3,
          des: "快点下班",
          dep_id: 0
        },
        k4: {
          id: 4,
          des: "肚子饿了",
          dep_id: 0
        },
        k5: {
          id: 5,
          des: "又要加班",
          dep_id: 0
        },
        k6: {
          id: 6,
          des: "好无聊啊",
          dep_id: 0
        },
        k7: {
          id: 7,
          des: "努力搬砖",
          dep_id: 0
        },
        k8: {
          id: 8,
          des: "坚持住啊",
          dep_id: 0
        },
        k9: {
          id: 9,
          des: "真不想干",
          dep_id: 0
        },
        k10: {
          id: 10,
          des: "业绩咋办",
          dep_id: 0
        },
        k11: {
          id: 11,
          des: "好困啊",
          dep_id: 0
        },
        k12: {
          id: 12,
          des: "快撑不住啦",
          dep_id: 0
        },
        k13: {
          id: 13,
          des: "加班加班",
          dep_id: 0
        },
        k14: {
          id: 14,
          des: "还没做完",
          dep_id: 0
        },
        k15: {
          id: 15,
          des: "牛马",
          dep_id: 0
        },
        k16: {
          id: 16,
          des: "有想法了",
          dep_id: 0
        },
        k17: {
          id: 17,
          des: "加油加油",
          dep_id: 0
        },
        k18: {
          id: 18,
          des: "好晕",
          dep_id: 0
        },
        k19: {
          id: 19,
          des: "喝个奶茶",
          dep_id: 0
        },
        k20: {
          id: 20,
          des: "方案真难",
          dep_id: 0
        },
        k21: {
          id: 21,
          des: "饿了",
          dep_id: 0
        },
        k22: {
          id: 22,
          des: "会议好长",
          dep_id: 0
        },
        k23: {
          id: 23,
          des: "好想下班",
          dep_id: 0
        },
        k24: {
          id: 24,
          des: "想要摸鱼",
          dep_id: 0
        },
        k25: {
          id: 25,
          des: "上班真苦",
          dep_id: 0
        },
        k26: {
          id: 26,
          des: "疲惫劳累想睡",
          dep_id: 0
        },
        k27: {
          id: 27,
          des: "点个咖啡续命",
          dep_id: 0
        },
        k28: {
          id: 28,
          des: "离下班还有多久",
          dep_id: 0
        },
        k29: {
          id: 29,
          des: "周末快来吧",
          dep_id: 0
        },
        k30: {
          id: 30,
          des: "看看调休",
          dep_id: 0
        },
        k31: {
          id: 31,
          des: "我要放假啊",
          dep_id: 0
        },
        k32: {
          id: 32,
          des: "早日退休",
          dep_id: 0
        },
        k33: {
          id: 33,
          des: "摸一会鱼",
          dep_id: 0
        },
        k34: {
          id: 34,
          des: "压力好大",
          dep_id: 0
        },
        k35: {
          id: 35,
          des: "掉了不少头发",
          dep_id: 0
        },
        k36: {
          id: 36,
          des: "头脑发懵",
          dep_id: 0
        },
        k37: {
          id: 37,
          des: "不想动脑",
          dep_id: 0
        },
        k38: {
          id: 38,
          des: "下班去哪玩",
          dep_id: 0
        },
        k39: {
          id: 39,
          des: "效率好低",
          dep_id: 0
        },
        k40: {
          id: 40,
          des: "好想请假",
          dep_id: 0
        },
        k41: {
          id: 41,
          des: "同事不错",
          dep_id: 0
        },
        k42: {
          id: 42,
          des: "听会歌",
          dep_id: 0
        },
        k43: {
          id: 43,
          des: "领导来了",
          dep_id: 0
        },
        k44: {
          id: 44,
          des: "工资好低",
          dep_id: 0
        },
        k45: {
          id: 45,
          des: "学新知识",
          dep_id: 0
        },
        k46: {
          id: 46,
          des: "有点迷茫",
          dep_id: 0
        },
        k47: {
          id: 47,
          des: "未来在哪",
          dep_id: 0
        },
        k48: {
          id: 48,
          des: "好想摆烂",
          dep_id: 0
        },
        k49: {
          id: 49,
          des: "冲冲冲",
          dep_id: 0
        },
        k50: {
          id: 50,
          des: "燃起来啦",
          dep_id: 0
        },
        k51: {
          id: 51,
          des: "数据不对",
          dep_id: 0
        },
        k52: {
          id: 52,
          des: "客户难哄",
          dep_id: 0
        },
        k53: {
          id: 53,
          des: "流程真复杂",
          dep_id: 0
        },
        k54: {
          id: 54,
          des: "团队真棒",
          dep_id: 0
        },
        k55: {
          id: 55,
          des: "我要继续努力",
          dep_id: 0
        },
        k56: {
          id: 56,
          des: "今天真累",
          dep_id: 0
        },
        k57: {
          id: 57,
          des: "好想旅游",
          dep_id: 0
        },
        k58: {
          id: 58,
          des: "点个外卖",
          dep_id: 0
        },
        k59: {
          id: 59,
          des: "吃点零食",
          dep_id: 0
        },
        k60: {
          id: 60,
          des: "出去透气",
          dep_id: 0
        },
        k61: {
          id: 61,
          des: "考核咋办",
          dep_id: 0
        },
        k62: {
          id: 62,
          des: "不想干了",
          dep_id: 0
        },
        k63: {
          id: 63,
          des: "争取晋升",
          dep_id: 0
        },
        k64: {
          id: 64,
          des: "拖到DDL",
          dep_id: 0
        },
        k65: {
          id: 65,
          des: "努力学习进步",
          dep_id: 0
        },
        k66: {
          id: 66,
          des: "加油拓展人脉",
          dep_id: 0
        },
        k67: {
          id: 67,
          des: "项目加油",
          dep_id: 0
        },
        k68: {
          id: 68,
          des: "网络好卡",
          dep_id: 0
        },
        k69: {
          id: 69,
          des: "经验总结",
          dep_id: 0
        },
        k70: {
          id: 70,
          des: "复盘下活动",
          dep_id: 0
        },
        k71: {
          id: 71,
          des: "反思错误",
          dep_id: 0
        },
        k72: {
          id: 72,
          des: "沟通好累",
          dep_id: 0
        },
        k73: {
          id: 73,
          des: "协调好难",
          dep_id: 0
        },
        k74: {
          id: 74,
          des: "还有多久发工资",
          dep_id: 0
        },
        k75: {
          id: 75,
          des: "倒杯水去",
          dep_id: 0
        },
        k76: {
          id: 76,
          des: "午餐吃啥呢",
          dep_id: 0
        },
        k77: {
          id: 77,
          des: "好烦",
          dep_id: 0
        },
        k78: {
          id: 78,
          des: "想吃甜点",
          dep_id: 0
        },
        k79: {
          id: 79,
          des: "灵感来啦",
          dep_id: 0
        },
        k80: {
          id: 80,
          des: "氛围很好",
          dep_id: 0
        },
        k81: {
          id: 81,
          des: "午休没睡好",
          dep_id: 0
        },
        k82: {
          id: 82,
          des: "失恋了",
          dep_id: 0
        },
        k83: {
          id: 83,
          des: "无心工作",
          dep_id: 0
        },
        k84: {
          id: 84,
          des: "努力干活",
          dep_id: 0
        },
        k85: {
          id: 85,
          des: "心情好好",
          dep_id: 0
        },
        k86: {
          id: 86,
          des: "快下班啦！",
          dep_id: 0
        },
        k87: {
          id: 87,
          des: "解决了大问题",
          dep_id: 0
        },
        k88: {
          id: 88,
          des: "我绝对是天才",
          dep_id: 0
        },
        k89: {
          id: 89,
          des: "下班去健身",
          dep_id: 0
        },
        k90: {
          id: 90,
          des: "打卡下班",
          dep_id: 0
        },
        k91: {
          id: 91,
          des: "看会小说",
          dep_id: 0
        },
        k92: {
          id: 92,
          des: "今天必须完成",
          dep_id: 0
        },
        k93: {
          id: 93,
          des: "发呆",
          dep_id: 0
        },
        k94: {
          id: 94,
          des: "包在我身上",
          dep_id: 0
        },
        k95: {
          id: 95,
          des: "搞定",
          dep_id: 0
        },
        k96: {
          id: 96,
          des: "开心开心",
          dep_id: 0
        },
        k97: {
          id: 97,
          des: "昨晚熬夜了",
          dep_id: 0
        },
        k98: {
          id: 98,
          des: "做不完啦",
          dep_id: 0
        },
        k99: {
          id: 99,
          des: "今晚要早点睡",
          dep_id: 0
        },
        k100: {
          id: 100,
          des: "看下放假时间表",
          dep_id: 0
        },
        k101: {
          id: 101,
          des: "今天效率不错",
          dep_id: 0
        },
        k102: {
          id: 102,
          des: "想喝咖啡",
          dep_id: 0
        },
        k103: {
          id: 103,
          des: "昨晚没睡好",
          dep_id: 0
        },
        k104: {
          id: 104,
          des: "快点下班",
          dep_id: 0
        },
        k105: {
          id: 105,
          des: "今天天气不错",
          dep_id: 0
        },
        k106: {
          id: 106,
          des: "不想加班",
          dep_id: 0
        },
        k107: {
          id: 107,
          des: "有点饿了",
          dep_id: 0
        },
        k108: {
          id: 108,
          des: "工作真多",
          dep_id: 0
        },
        k109: {
          id: 109,
          des: "周末快来",
          dep_id: 0
        },
        k110: {
          id: 110,
          des: "有点无聊",
          dep_id: 0
        },
        k111: {
          id: 111,
          des: "又要开会",
          dep_id: 0
        },
        k112: {
          id: 112,
          des: "有些疲惫",
          dep_id: 0
        },
        k113: {
          id: 113,
          des: "有点闷",
          dep_id: 0
        },
        k114: {
          id: 114,
          des: "心情不错",
          dep_id: 0
        },
        k115: {
          id: 115,
          des: "同事有趣",
          dep_id: 0
        },
        k116: {
          id: 116,
          des: "任务好重",
          dep_id: 0
        },
        k117: {
          id: 117,
          des: "集中精力",
          dep_id: 0
        },
        k118: {
          id: 118,
          des: "眼睛好累",
          dep_id: 0
        },
        k119: {
          id: 119,
          des: "想出去玩",
          dep_id: 0
        },
        k120: {
          id: 120,
          des: "多拿点工资",
          dep_id: 0
        },
        k121: {
          id: 121,
          des: "有点头疼",
          dep_id: 0
        },
        k122: {
          id: 122,
          des: "快点午休",
          dep_id: 0
        },
        k123: {
          id: 123,
          des: "怀念假期",
          dep_id: 0
        },
        k124: {
          id: 124,
          des: "天气真好",
          dep_id: 0
        },
        k125: {
          id: 125,
          des: "衣服穿多了",
          dep_id: 0
        },
        k126: {
          id: 126,
          des: "心情低落",
          dep_id: 0
        },
        k127: {
          id: 127,
          des: "熬夜熬猛了",
          dep_id: 0
        },
        k128: {
          id: 128,
          des: "摸鱼暂停",
          dep_id: 0
        },
        k129: {
          id: 129,
          des: "赶紧干活",
          dep_id: 0
        },
        k130: {
          id: 130,
          des: "有点紧张",
          dep_id: 0
        },
        k131: {
          id: 131,
          des: "不想说话",
          dep_id: 0
        },
        k132: {
          id: 132,
          des: "想看电影",
          dep_id: 0
        },
        k133: {
          id: 133,
          des: "有点小烦",
          dep_id: 0
        },
        k134: {
          id: 134,
          des: "天气闷热",
          dep_id: 0
        },
        k135: {
          id: 135,
          des: "想深呼吸",
          dep_id: 0
        },
        k136: {
          id: 136,
          des: "写点周末计划",
          dep_id: 0
        },
        k137: {
          id: 137,
          des: "有点困倦",
          dep_id: 0
        },
        k138: {
          id: 138,
          des: "邮件好多",
          dep_id: 0
        },
        k139: {
          id: 139,
          des: "想吃水果",
          dep_id: 0
        },
        k140: {
          id: 140,
          des: "养生",
          dep_id: 0
        },
        k141: {
          id: 141,
          des: "期待旅游",
          dep_id: 0
        },
        k142: {
          id: 142,
          des: "不想动脑",
          dep_id: 0
        },
        k143: {
          id: 143,
          des: "快快完成工作",
          dep_id: 0
        },
        k144: {
          id: 144,
          des: "想打游戏",
          dep_id: 0
        },
        k145: {
          id: 145,
          des: "有点口渴",
          dep_id: 0
        },
        k146: {
          id: 146,
          des: "桌面好乱",
          dep_id: 0
        },
        k147: {
          id: 147,
          des: "收拾一下",
          dep_id: 0
        },
        k148: {
          id: 148,
          des: "同事好吵",
          dep_id: 0
        },
        k149: {
          id: 149,
          des: "憧憬未来",
          dep_id: 0
        },
        k150: {
          id: 150,
          des: "想要发呆",
          dep_id: 0
        },
        k151: {
          id: 151,
          des: "今天早点下班",
          dep_id: 0
        },
        k152: {
          id: 152,
          des: "有点烦躁",
          dep_id: 0
        },
        k153: {
          id: 153,
          des: "整理头绪",
          dep_id: 0
        },
        k154: {
          id: 154,
          des: "眼睛好酸",
          dep_id: 0
        },
        k155: {
          id: 155,
          des: "肚子咕咕叫",
          dep_id: 0
        },
        k156: {
          id: 156,
          des: "想吃点啥",
          dep_id: 0
        },
        k157: {
          id: 157,
          des: "多喝热水",
          dep_id: 0
        },
        k158: {
          id: 158,
          des: "衣服穿少了",
          dep_id: 0
        },
        k159: {
          id: 159,
          des: "心情有点糟",
          dep_id: 0
        },
        k160: {
          id: 160,
          des: "外面下雨了",
          dep_id: 0
        },
        k161: {
          id: 161,
          des: "不想动啊",
          dep_id: 0
        },
        k162: {
          id: 162,
          des: "我是真的很不错",
          dep_id: 0
        },
        k163: {
          id: 163,
          des: "看错数据了",
          dep_id: 0
        },
        k164: {
          id: 164,
          des: "任务减半",
          dep_id: 0
        },
        k165: {
          id: 165,
          des: "轻松多了",
          dep_id: 0
        },
        k166: {
          id: 166,
          des: "快点搞定",
          dep_id: 0
        },
        k167: {
          id: 167,
          des: "有点期待下班",
          dep_id: 0
        },
        k168: {
          id: 168,
          des: "马上周五",
          dep_id: 0
        },
        k169: {
          id: 169,
          des: "离周末不远啦",
          dep_id: 0
        },
        k170: {
          id: 170,
          des: "有点小兴奋",
          dep_id: 0
        },
        k171: {
          id: 171,
          des: "不想上班啊",
          dep_id: 0
        },
        k172: {
          id: 172,
          des: "心情沉重",
          dep_id: 0
        },
        k173: {
          id: 173,
          des: "想发脾气",
          dep_id: 0
        },
        k174: {
          id: 174,
          des: "快点过去",
          dep_id: 0
        },
        k175: {
          id: 175,
          des: "头晕眼花",
          dep_id: 0
        },
        k176: {
          id: 176,
          des: "明天再说吧",
          dep_id: 0
        },
        k177: {
          id: 177,
          des: "同事真好",
          dep_id: 0
        },
        k178: {
          id: 178,
          des: "有点感动",
          dep_id: 0
        },
        k179: {
          id: 179,
          des: "天气好闷",
          dep_id: 0
        },
        k180: {
          id: 180,
          des: "感觉累累的",
          dep_id: 0
        },
        k181: {
          id: 181,
          des: "呼吸下新鲜空气",
          dep_id: 0
        },
        k182: {
          id: 182,
          des: "有点压抑",
          dep_id: 0
        },
        k183: {
          id: 183,
          des: "想出去走走",
          dep_id: 0
        },
        k184: {
          id: 184,
          des: "不想干活了",
          dep_id: 0
        },
        k185: {
          id: 185,
          des: "有点失落",
          dep_id: 0
        },
        k186: {
          id: 186,
          des: "想被表扬",
          dep_id: 0
        },
        k187: {
          id: 187,
          des: "快点进步",
          dep_id: 0
        },
        k188: {
          id: 188,
          des: "有点焦虑",
          dep_id: 0
        },
        k189: {
          id: 189,
          des: "想找安慰",
          dep_id: 0
        },
        k190: {
          id: 190,
          des: "快点成长",
          dep_id: 0
        },
        k191: {
          id: 191,
          des: "有点迷茫",
          dep_id: 0
        },
        k192: {
          id: 192,
          des: "想找方向",
          dep_id: 0
        },
        k193: {
          id: 193,
          des: "快点突破",
          dep_id: 0
        },
        k194: {
          id: 194,
          des: "有点累了",
          dep_id: 0
        },
        k195: {
          id: 195,
          des: "专心工作",
          dep_id: 0
        },
        k196: {
          id: 196,
          des: "快点振作",
          dep_id: 0
        },
        k197: {
          id: 197,
          des: "有点烦躁不安",
          dep_id: 0
        },
        k198: {
          id: 198,
          des: "想深呼吸放松",
          dep_id: 0
        },
        k199: {
          id: 199,
          des: "调整状态",
          dep_id: 0
        },
        k200: {
          id: 200,
          des: "有点心不在焉",
          dep_id: 0
        },
        k201: {
          id: 201,
          des: "集中注意力",
          dep_id: 0
        },
        k202: {
          id: 202,
          des: "怀念过去",
          dep_id: 0
        },
        k203: {
          id: 203,
          des: "回忆美好时光",
          dep_id: 0
        },
        k204: {
          id: 204,
          des: "找点乐子",
          dep_id: 0
        },
        k205: {
          id: 205,
          des: "有趣，太有趣了",
          dep_id: 0
        },
        k206: {
          id: 206,
          des: "原地下班",
          dep_id: 0
        },
        k207: {
          id: 207,
          des: "规划下未来",
          dep_id: 0
        },
        k208: {
          id: 208,
          des: "成为更好的自己",
          dep_id: 0
        },
        k209: {
          id: 209,
          des: "行动起来",
          dep_id: 0
        },
        k210: {
          id: 210,
          des: "今天效率好高",
          dep_id: 0
        },
        k211: {
          id: 211,
          des: "搞钱搞钱",
          dep_id: 1001
        },
        k212: {
          id: 212,
          des: "多拓展些业务",
          dep_id: 1001
        },
        k213: {
          id: 213,
          des: "公司要怎么发展呢",
          dep_id: 1001
        },
        k214: {
          id: 214,
          des: "压力有点大",
          dep_id: 1001
        },
        k215: {
          id: 215,
          des: "抓住发展机会",
          dep_id: 1001
        },
        k216: {
          id: 216,
          des: "行程安排完成",
          dep_id: 1002
        },
        k217: {
          id: 217,
          des: "会议记录完成",
          dep_id: 1002
        },
        k218: {
          id: 218,
          des: "好多邮件要回复",
          dep_id: 1002
        },
        k219: {
          id: 219,
          des: "会议筹备完成",
          dep_id: 1002
        },
        k220: {
          id: 220,
          des: "文件整理完成",
          dep_id: 1002
        },
        k221: {
          id: 221,
          des: "股票快涨",
          dep_id: 1003
        },
        k222: {
          id: 222,
          des: "感觉需要节约成本",
          dep_id: 1003
        },
        k223: {
          id: 223,
          des: "多赚点钱",
          dep_id: 1003
        },
        k224: {
          id: 224,
          des: "最近发展不错",
          dep_id: 1003
        },
        k225: {
          id: 225,
          des: "年终多分红",
          dep_id: 1003
        },
        k226: {
          id: 226,
          des: "合同审核完成",
          dep_id: "1101|1201|1203|1204"
        },
        k227: {
          id: 227,
          des: "完美处理纠纷",
          dep_id: "1101|1201|1203|1204"
        },
        k228: {
          id: 228,
          des: "帮公司规避了风险",
          dep_id: "1101|1201|1203|1204"
        },
        k229: {
          id: 229,
          des: "好多合同需要处理",
          dep_id: "1101|1201|1203|1204"
        },
        k230: {
          id: 230,
          des: "新增了好多法规",
          dep_id: "1101|1201|1203|1204"
        },
        k231: {
          id: 231,
          des: "购买一些办公用品",
          dep_id: "1102|1204|1205|1206"
        },
        k232: {
          id: 232,
          des: "绿植需要维护了",
          dep_id: "1102|1204|1205|1206"
        },
        k233: {
          id: 233,
          des: "规划一下团建吧",
          dep_id: "1102|1204|1205|1206"
        },
        k234: {
          id: 234,
          des: "制定企业文化手册",
          dep_id: "1102|1204|1205|1206"
        },
        k235: {
          id: 235,
          des: "进行打卡汇总",
          dep_id: "1102|1204|1205|1206"
        },
        k236: {
          id: 236,
          des: "好多业务内容",
          dep_id: 1103
        },
        k237: {
          id: 237,
          des: "绩效定得好高",
          dep_id: 1103
        },
        k238: {
          id: 238,
          des: "发愁",
          dep_id: 1103
        },
        k239: {
          id: 239,
          des: "签下新业务啦",
          dep_id: 1103
        },
        k240: {
          id: 240,
          des: "奖励自己一顿火锅",
          dep_id: 1103
        },
        k241: {
          id: 241,
          des: "预算审批完成",
          dep_id: "1104|1210|1211|1212"
        },
        k242: {
          id: 242,
          des: "怎么少了一毛钱",
          dep_id: "1104|1210|1211|1212"
        },
        k243: {
          id: 243,
          des: "焦头烂额啦",
          dep_id: "1104|1210|1211|1212"
        },
        k244: {
          id: 244,
          des: "快要发工资了",
          dep_id: "1104|1210|1211|1212"
        },
        k245: {
          id: 245,
          des: "成本核算完成",
          dep_id: "1104|1210|1211|1212"
        },
        k246: {
          id: 246,
          des: "保卫公司安全",
          dep_id: 1105
        },
        k247: {
          id: 247,
          des: "来访者记得签到",
          dep_id: 1105
        },
        k248: {
          id: 248,
          des: "要睡着了",
          dep_id: 1105
        },
        k249: {
          id: 249,
          des: "那个人有点陌生",
          dep_id: 1105
        },
        k250: {
          id: 250,
          des: "坐等下班",
          dep_id: 1105
        },
        k251: {
          id: 251,
          des: "紧急公关",
          dep_id: 1106
        },
        k252: {
          id: 252,
          des: "品牌宣传搞定",
          dep_id: 1106
        },
        k253: {
          id: 253,
          des: "今天完成得不错",
          dep_id: 1106
        },
        k254: {
          id: 254,
          des: "媒体关系维护完成",
          dep_id: 1106
        },
        k255: {
          id: 255,
          des: "危机预案完成",
          dep_id: 1106
        },
        k256: {
          id: 256,
          des: "研发新产品",
          dep_id: 1207
        },
        k257: {
          id: 257,
          des: "进行下用户调研",
          dep_id: 1207
        },
        k258: {
          id: 258,
          des: "分析用户需求",
          dep_id: 1207
        },
        k259: {
          id: 259,
          des: "没有灵感",
          dep_id: 1207
        },
        k260: {
          id: 260,
          des: "灵感爆发啦",
          dep_id: 1207
        },
        k261: {
          id: 261,
          des: "速速解决BUG",
          dep_id: 1208
        },
        k262: {
          id: 262,
          des: "想不出来处理方案",
          dep_id: 1208
        },
        k263: {
          id: 263,
          des: "这次处理方式不错",
          dep_id: 1208
        },
        k264: {
          id: 264,
          des: "感觉技术力提升了",
          dep_id: 1208
        },
        k265: {
          id: 265,
          des: "回家再多学一点",
          dep_id: 1208
        },
        k266: {
          id: 266,
          des: "多拓展一些市场",
          dep_id: 1209
        },
        k267: {
          id: 267,
          des: "进行实地调查",
          dep_id: 1209
        },
        k268: {
          id: 268,
          des: "这个地方不错",
          dep_id: 1209
        },
        k269: {
          id: 269,
          des: "记录一下",
          dep_id: 1209
        },
        k270: {
          id: 270,
          des: "感觉这个地方还行",
          dep_id: 1209
        },
        k271: {
          id: 271,
          des: "今日份的采购计划...",
          dep_id: 1301
        },
        k272: {
          id: 272,
          des: "采购完成",
          dep_id: 1301
        },
        k273: {
          id: 273,
          des: "下班去吃小烧烤",
          dep_id: 1301
        },
        k274: {
          id: 274,
          des: "联系下合作方",
          dep_id: 1301
        },
        k275: {
          id: 275,
          des: "该采购一批了...",
          dep_id: 1301
        },
        k276: {
          id: 276,
          des: "寻找新的宿舍点",
          dep_id: 1302
        },
        k277: {
          id: 277,
          des: "现在的宿舍满员了",
          dep_id: 1302
        },
        k278: {
          id: 278,
          des: "这个食堂不行",
          dep_id: 1302
        },
        k279: {
          id: 279,
          des: "这家食堂味道不错",
          dep_id: 1302
        },
        k280: {
          id: 280,
          des: "食宿安排必须好",
          dep_id: 1302
        },
        k281: {
          id: 281,
          des: "物资准备齐全",
          dep_id: 1303
        },
        k282: {
          id: 282,
          des: "清点下物资",
          dep_id: 1303
        },
        k283: {
          id: 283,
          des: "感觉缺点什么",
          dep_id: 1303
        },
        k284: {
          id: 284,
          des: "还要加点东西",
          dep_id: 1303
        },
        k285: {
          id: 285,
          des: "嗯，物资数量没错",
          dep_id: 1303
        },
        k286: {
          id: 286,
          des: "想点新方案",
          dep_id: "1304|1401|1402|1403"
        },
        k287: {
          id: 287,
          des: "太好了这个方案",
          dep_id: "1304|1401|1402|1403"
        },
        k288: {
          id: 288,
          des: "感觉还行",
          dep_id: "1304|1401|1402|1403"
        },
        k289: {
          id: 289,
          des: "头有点大",
          dep_id: "1304|1401|1402|1403"
        },
        k290: {
          id: 290,
          des: "抓紧出方案",
          dep_id: "1304|1401|1402|1403"
        },
        k291: {
          id: 291,
          des: "不愧是我",
          dep_id: "1305|1404|1405|1406"
        },
        k292: {
          id: 292,
          des: "天才的想法",
          dep_id: "1305|1404|1405|1406"
        },
        k293: {
          id: 293,
          des: "什么是五彩斑斓的黑",
          dep_id: "1305|1404|1405|1406"
        },
        k294: {
          id: 294,
          des: "又要用回第一版？",
          dep_id: "1305|1404|1405|1406"
        },
        k295: {
          id: 295,
          des: "效率upup",
          dep_id: "1305|1404|1405|1406"
        },
        k296: {
          id: 296,
          des: "有点头绪了",
          dep_id: 1306
        },
        k297: {
          id: 297,
          des: "这个方法不错",
          dep_id: 1306
        },
        k298: {
          id: 298,
          des: "完成进度过半",
          dep_id: 1306
        },
        k299: {
          id: 299,
          des: "我可能真是天才",
          dep_id: 1306
        },
        k300: {
          id: 300,
          des: "寻找一下参考",
          dep_id: 1306
        },
        k301: {
          id: 301,
          des: "要出新活动了",
          dep_id: "1307|1407|1408|1409"
        },
        k302: {
          id: 302,
          des: "什么活动最好呢",
          dep_id: "1307|1407|1408|1409"
        },
        k303: {
          id: 303,
          des: "进行下市场调研",
          dep_id: "1307|1407|1408|1409"
        },
        k304: {
          id: 304,
          des: "分析下用户数据",
          dep_id: "1307|1407|1408|1409"
        },
        k305: {
          id: 305,
          des: "新活动反响不错",
          dep_id: "1307|1407|1408|1409"
        },
        k306: {
          id: 306,
          des: "又有新需求了",
          dep_id: "1308|1410|1411|1412"
        },
        k307: {
          id: 307,
          des: "下班回家打游戏",
          dep_id: "1308|1410|1411|1412"
        },
        k308: {
          id: 308,
          des: "怎么又有BUG",
          dep_id: "1308|1410|1411|1412"
        },
        k309: {
          id: 309,
          des: "摸不着头脑",
          dep_id: "1308|1410|1411|1412"
        },
        k310: {
          id: 310,
          des: "找到问题了",
          dep_id: "1308|1410|1411|1412"
        },
        k311: {
          id: 311,
          des: "感觉哪里有点不对",
          dep_id: "1309|1413|1414|1415"
        },
        k312: {
          id: 312,
          des: "记录一下BUG",
          dep_id: "1309|1413|1414|1415"
        },
        k313: {
          id: 313,
          des: "我有些想法...",
          dep_id: "1309|1413|1414|1415"
        },
        k314: {
          id: 314,
          des: "这里可以改进下...",
          dep_id: "1309|1413|1414|1415"
        },
        k315: {
          id: 315,
          des: "完美啊",
          dep_id: "1309|1413|1414|1415"
        },
        k316: {
          id: 316,
          des: "系统维护完成",
          dep_id: 1310
        },
        k317: {
          id: 317,
          des: "故障排查完成",
          dep_id: 1310
        },
        k318: {
          id: 318,
          des: "性能监控完成",
          dep_id: 1310
        },
        k319: {
          id: 319,
          des: "数据备份完成",
          dep_id: 1310
        },
        k320: {
          id: 320,
          des: "安全加固完成",
          dep_id: 1310
        },
        k321: {
          id: 321,
          des: "业绩完成得不错",
          dep_id: "1311|1416|1417|1418"
        },
        k322: {
          id: 322,
          des: "没有收获的一天",
          dep_id: "1311|1416|1417|1418"
        },
        k323: {
          id: 323,
          des: "又被挂电话了",
          dep_id: "1311|1416|1417|1418"
        },
        k324: {
          id: 324,
          des: "给自己打打气",
          dep_id: "1311|1416|1417|1418"
        },
        k325: {
          id: 325,
          des: "联系一下客户",
          dep_id: "1311|1416|1417|1418"
        },
        k326: {
          id: 326,
          des: "想一下创意内容",
          dep_id: 1312
        },
        k327: {
          id: 327,
          des: "整理一下宣传素材",
          dep_id: 1312
        },
        k328: {
          id: 328,
          des: "这次宣传效果不错",
          dep_id: 1312
        },
        k329: {
          id: 329,
          des: "新方案策划完成",
          dep_id: 1312
        },
        k330: {
          id: 330,
          des: "热点追踪完成",
          dep_id: 1312
        },
        k331: {
          id: 331,
          des: "收集到了新数据",
          dep_id: 1313
        },
        k332: {
          id: 332,
          des: "要怎么找关键数据呢",
          dep_id: 1313
        },
        k333: {
          id: 333,
          des: "这次收集的数据不错",
          dep_id: 1313
        },
        k334: {
          id: 334,
          des: "搜索一下调查渠道",
          dep_id: 1313
        },
        k335: {
          id: 335,
          des: "数据出错了...",
          dep_id: 1313
        },
        k336: {
          id: 336,
          des: "完美解决客诉",
          dep_id: "1314|1419|1420|1421"
        },
        k337: {
          id: 337,
          des: "学习一下新话术",
          dep_id: "1314|1419|1420|1421"
        },
        k338: {
          id: 338,
          des: "被顾客骂了",
          dep_id: "1314|1419|1420|1421"
        },
        k339: {
          id: 339,
          des: "学到了新的解决方式",
          dep_id: "1314|1419|1420|1421"
        },
        k340: {
          id: 340,
          des: "这个问题好难啊",
          dep_id: "1314|1419|1420|1421"
        }
      });
      e._RF.pop()
    }
  }
}));