System.register("chunks:///_virtual/co_banquet.ts", ["cc"], (function(e) {
  "use strict";
  var d;
  return {
    setters: [function(e) {
      d = e.cclegacy
    }],
    execute: function() {
      d._RF.push({}, "6fa5eplIRZLmoYlCtjl0mHS", "co_banquet", void 0);
      e("co_banquet", {
        k1: {
          id: 1,
          name: "社区食堂",
          grade: 1,
          need: 0,
          des: "没啥好菜|还不如点个外卖来吃|硬菜都没几个|我就不该抱有期待的|一点都不卫生|环境有点倒胃口|服务员的态度真是一言难尽|咸得我怀疑人生|升职宴不配吃点好的吗？|环境很脏，周围都是垃圾"
        },
        k2: {
          id: 2,
          name: "街边麻辣烫",
          grade: 1,
          need: 0,
          des: "都没吃饱|辣到灵魂出窍|辣到看见太奶了|辣到天灵盖喷火|呕，在碗里吃到了假睫毛|氛围还可以，不算太差|不太合口味|味道一般般，也就那样吧|煮的时间太短了吧"
        },
        k3: {
          id: 3,
          name: "自助小火锅",
          grade: 2,
          need: "2|4",
          des: "味道马马虎虎|也就那样吧|毛血旺里的鸭血，像极了加班的我|感觉有些食材都变质了|筷子上都有霉斑|感觉还不如沙县国际|董事长居然要求员工先行垫付"
        },
        k4: {
          id: 4,
          name: "特色家常菜馆",
          grade: 2,
          need: "2|4",
          des: "只有家常菜，没有特色菜|今天让自己的胃受委屈了|吃了个好大的“饼”|菜品有点单调，不够丰富|硬菜藏得比年终奖还深|油放得太多了|我看到苍蝇在剩菜区开运动会|居然只点了几个素菜"
        },
        k5: {
          id: 5,
          name: "夜市大排档",
          grade: 3,
          need: "2|8",
          des: "可能是预算有限吧，没看到啥硬菜|白灼菜心比我简历还寡淡|连像样的硬菜都没有|塑料凳包浆厚度堪比文物|人多得像沙丁鱼罐头|整体感觉还算可以"
        },
        k6: {
          id: 6,
          name: "网红餐厅",
          grade: 3,
          need: "2|8",
          des: "氛围还行吧|不算差|有好几样是自己爱吃的|共享充电宝的归还点，比初恋的心还难找|菜品精致，味道绝佳|环境优雅，服务周到|菜品别具一格，值得推荐|环境和服务都不错"
        },
        k7: {
          id: 7,
          name: "主题酒吧",
          grade: 4,
          need: "2|12",
          des: "还行，挺热闹的|等位两小时，吃饭十分钟|食物精致可口，值得推荐|最后一杯叫「未完待续」|环境优雅，服务周到|服务员的素质很高|比我想象中的要好一些|酒吧的环境很有情调"
        },
        k8: {
          id: 8,
          name: "庭院烧烤自助",
          grade: 4,
          need: "2|12",
          des: "挺愉快的|各种食材应有尽有|真是来对了地方|肉类都是新鲜的，口感特别好|现摘香草无限量供应，棒|全程享受黄金焦脆时刻|碳水+油脂的终极狂欢|瞬间穿越回姥姥家小院夏夜"
        },
        k9: {
          id: 9,
          name: "海鲜大酒楼",
          grade: 5,
          need: "2|16",
          des: "每一口都能感受到鲜|食物的品质和种类都超出了预期|环境优美，服务周到|味道鲜美，环境舒适|装修太豪华了|董事长居然给我夹菜了|海鲜品质上乘，烹饪手法独特"
        },
        k10: {
          id: 10,
          name: "豪华江景茶楼",
          grade: 5,
          need: "2|16",
          des: "摆盘真是精美|这顿饭可不便宜|环境优雅，空气清新|心情格外舒畅|服务员记性堪比AI|今天，大饱口福|选的地方真是不错|非常满足|董事长把我们的嘴都给养叼了|就想问问吃胖了能算工伤吗？"
        },
        k11: {
          id: 11,
          name: "五星级大酒店",
          grade: 6,
          need: "2|20",
          des: "董事长真是舍得|感觉一顿吃掉了三年工资|进步，进步，我一定要进步|每一道菜都有独特的风味|董事长点了我喜欢吃的菜|吃得非常尽兴|帝王蟹钳比年终奖还震撼|洗手间香氛藏着上市代码"
        },
        k12: {
          id: 12,
          name: "古堡庄园私宴",
          grade: 6,
          need: "2|20",
          des: "董事长真是舍得|感觉一顿吃掉了三年工资|进步，进步，我一定要进步|视觉和味觉，得到了双重享受|吃得开心，玩得尽兴|董事长真是太慷慨了|我们有个钱多人傻的董事长|菜单都是镶金边的"
        }
      });
      d._RF.pop()
    }
  }
}));