System.register("chunks:///_virtual/co_year_award.ts", ["cc"], (function(e) {
  "use strict";
  var a;
  return {
    setters: [function(e) {
      a = e.cclegacy
    }],
    execute: function() {
      a._RF.push({}, "57d1dH7LMNPzJuqd9nsBZXS", "co_year_award", void 0);
      e("co_year_award", {
        k1: {
          id: 1,
          grade1: 6,
          grade2: 12,
          rate: 10,
          value: 10,
          des: "我不该对这公司抱有期待的|是时候考虑换个公司了|我的心凉透了|就这，还未来可期？|怎么不发一箱核桃奶，给我补补脑|越来越没奔头了|我想暴富的梦想破灭了|真是让人心酸|懒得吐槽|也不算很差了|说的是发狼性奖金，到手的却是狗粮优惠券|呵呵，给我整笑了！|我没眼花吧，董事长是不是少打了个0？|没事哒，没事哒|开摆|是时候打开招聘软件了|这，是我看错了吗？|不敢睁开眼，希望是我的幻觉"
        },
        k2: {
          id: 2,
          grade1: 6,
          grade2: 12,
          rate: 5,
          value: 20,
          des: "我不该对这公司抱有期待的|是时候考虑换个公司了|我的心凉透了|就这，还未来可期？|怎么不发一箱核桃奶，给我补补脑|越来越没奔头了|我想暴富的梦想破灭了|真是让人心酸|懒得吐槽|也不算很差了|说的是发狼性奖金，到手的却是狗粮优惠券|呵呵，给我整笑了！|我没眼花吧，董事长是不是少打了个0？|没事哒，没事哒|开摆|是时候打开招聘软件了|这，是我看错了吗？|不敢睁开眼，希望是我的幻觉"
        },
        k3: {
          id: 3,
          grade1: 6,
          grade2: 12,
          rate: 2,
          value: 30,
          des: "我不该对这公司抱有期待的|是时候考虑换个公司了|我的心凉透了|就这，还未来可期？|怎么不发一箱核桃奶，给我补补脑|越来越没奔头了|我想暴富的梦想破灭了|真是让人心酸|懒得吐槽|也不算很差了|说的是发狼性奖金，到手的却是狗粮优惠券|呵呵，给我整笑了！|我没眼花吧，董事长是不是少打了个0？|没事哒，没事哒|开摆|是时候打开招聘软件了|这，是我看错了吗？|不敢睁开眼，希望是我的幻觉"
        },
        k4: {
          id: 4,
          grade1: 6,
          grade2: 12,
          rate: 1,
          value: 50,
          des: "我不该对这公司抱有期待的|是时候考虑换个公司了|我的心凉透了|就这，还未来可期？|怎么不发一箱核桃奶，给我补补脑|越来越没奔头了|我想暴富的梦想破灭了|真是让人心酸|懒得吐槽|也不算很差了|说的是发狼性奖金，到手的却是狗粮优惠券|呵呵，给我整笑了！|我没眼花吧，董事长是不是少打了个0？|没事哒，没事哒|开摆|是时候打开招聘软件了|这，是我看错了吗？|不敢睁开眼，希望是我的幻觉"
        },
        k5: {
          id: 5,
          grade1: 13,
          grade2: 18,
          rate: 20,
          value: 15,
          des: "马马虎虎的吧|是不是我太容易满足了？|有点敷衍的感觉|多发一点又不会怎么样|董事长的格局，也就这样了|比上不足，比下也不怎么有余|同事间都不好意思互相打听|说惊喜谈不上，说失望也不至于|老板的格局就值这个数|没隔壁公司多|就不该抱有太大希望|也行吧，有总比没有好|别人问起来，我都不好意思说|老板还能再抠一点吗？|不是吧不是吧，就这啊|信了老板画的大饼|勉强能接受|看起来还行"
        },
        k6: {
          id: 6,
          grade1: 13,
          grade2: 18,
          rate: 10,
          value: 30,
          des: "马马虎虎的吧|是不是我太容易满足了？|有点敷衍的感觉|多发一点又不会怎么样|董事长的格局，也就这样了|比上不足，比下也不怎么有余|同事间都不好意思互相打听|说惊喜谈不上，说失望也不至于|老板的格局就值这个数|没隔壁公司多|就不该抱有太大希望|也行吧，有总比没有好|别人问起来，我都不好意思说|老板还能再抠一点吗？|不是吧不是吧，就这啊|信了老板画的大饼|勉强能接受|看起来还行"
        },
        k7: {
          id: 7,
          grade1: 13,
          grade2: 18,
          rate: 6,
          value: 45,
          des: "马马虎虎的吧|是不是我太容易满足了？|有点敷衍的感觉|多发一点又不会怎么样|董事长的格局，也就这样了|比上不足，比下也不怎么有余|同事间都不好意思互相打听|说惊喜谈不上，说失望也不至于|老板的格局就值这个数|没隔壁公司多|就不该抱有太大希望|也行吧，有总比没有好|别人问起来，我都不好意思说|老板还能再抠一点吗？|不是吧不是吧，就这啊|信了老板画的大饼|勉强能接受|看起来还行"
        },
        k8: {
          id: 8,
          grade1: 13,
          grade2: 18,
          rate: 2,
          value: 75,
          des: "马马虎虎的吧|是不是我太容易满足了？|有点敷衍的感觉|多发一点又不会怎么样|董事长的格局，也就这样了|比上不足，比下也不怎么有余|同事间都不好意思互相打听|说惊喜谈不上，说失望也不至于|老板的格局就值这个数|没隔壁公司多|就不该抱有太大希望|也行吧，有总比没有好|别人问起来，我都不好意思说|老板还能再抠一点吗？|不是吧不是吧，就这啊|信了老板画的大饼|勉强能接受|看起来还行"
        },
        k9: {
          id: 9,
          grade1: 19,
          grade2: 24,
          rate: 30,
          value: 20,
          des: "希望明年更进一步|感觉被公司偏爱了|比上不足，比下有余|算是有点小惊喜吧|达到了自己的心理预期|我已经很满足了|今年总算没吃土|呵呵，我旁边的同事眼睛都看直了|老板英明神武、千秋万代|今年不算少|今年挺给力的|奖金发到手，干活不用吼|在这公司上班，心里踏实|老板大气|比预想的还多一些|跟预想中的差不多|一年的辛苦没有白费|新的一年要更加努力|我现在浑身充满了动力"
        },
        k10: {
          id: 10,
          grade1: 19,
          grade2: 24,
          rate: 15,
          value: 40,
          des: "希望明年更进一步|感觉被公司偏爱了|比上不足，比下有余|算是有点小惊喜吧|达到了自己的心理预期|我已经很满足了|今年总算没吃土|呵呵，我旁边的同事眼睛都看直了|老板英明神武、千秋万代|今年不算少|今年挺给力的|奖金发到手，干活不用吼|在这公司上班，心里踏实|老板大气|比预想的还多一些|跟预想中的差不多|一年的辛苦没有白费|新的一年要更加努力|我现在浑身充满了动力"
        },
        k11: {
          id: 11,
          grade1: 19,
          grade2: 24,
          rate: 6,
          value: 60,
          des: "希望明年更进一步|感觉被公司偏爱了|比上不足，比下有余|算是有点小惊喜吧|达到了自己的心理预期|我已经很满足了|今年总算没吃土|呵呵，我旁边的同事眼睛都看直了|老板英明神武、千秋万代|今年不算少|今年挺给力的|奖金发到手，干活不用吼|在这公司上班，心里踏实|老板大气|比预想的还多一些|跟预想中的差不多|一年的辛苦没有白费|新的一年要更加努力|我现在浑身充满了动力"
        },
        k12: {
          id: 12,
          grade1: 19,
          grade2: 24,
          rate: 3,
          value: 100,
          des: "希望明年更进一步|感觉被公司偏爱了|比上不足，比下有余|算是有点小惊喜吧|达到了自己的心理预期|我已经很满足了|今年总算没吃土|呵呵，我旁边的同事眼睛都看直了|老板英明神武、千秋万代|今年不算少|今年挺给力的|奖金发到手，干活不用吼|在这公司上班，心里踏实|老板大气|比预想的还多一些|跟预想中的差不多|一年的辛苦没有白费|新的一年要更加努力|我现在浑身充满了动力"
        },
        k13: {
          id: 13,
          grade1: 25,
          grade2: 30,
          rate: 40,
          value: 25,
          des: "好羡慕那些奖励多的|惊喜又感动|来这公司，我就是来对了|加班疲惫，瞬间治愈|入职时说的共赢，今年终于具象化|入职时HR说的家文化，今年信了|准备和公司再战十年|到手的厚度，快赶上新华字典了|实锤，老板家里有矿|老板真是豪爽|隔壁公司的小姐姐都馋哭了|我决定了，以后把公司当成家|老板不愧是老板|要不说老板怎么是老板呢，就是不一样|内心的激动，无法用言语表达"
        },
        k14: {
          id: 14,
          grade1: 25,
          grade2: 30,
          rate: 20,
          value: 50,
          des: "好羡慕那些奖励多的|惊喜又感动|来这公司，我就是来对了|加班疲惫，瞬间治愈|入职时说的共赢，今年终于具象化|入职时HR说的家文化，今年信了|准备和公司再战十年|到手的厚度，快赶上新华字典了|实锤，老板家里有矿|老板真是豪爽|隔壁公司的小姐姐都馋哭了|我决定了，以后把公司当成家|老板不愧是老板|要不说老板怎么是老板呢，就是不一样|内心的激动，无法用言语表达"
        },
        k15: {
          id: 15,
          grade1: 25,
          grade2: 30,
          rate: 8,
          value: 75,
          des: "好羡慕那些奖励多的|惊喜又感动|来这公司，我就是来对了|加班疲惫，瞬间治愈|入职时说的共赢，今年终于具象化|入职时HR说的家文化，今年信了|准备和公司再战十年|到手的厚度，快赶上新华字典了|实锤，老板家里有矿|老板真是豪爽|隔壁公司的小姐姐都馋哭了|我决定了，以后把公司当成家|老板不愧是老板|要不说老板怎么是老板呢，就是不一样|内心的激动，无法用言语表达"
        },
        k16: {
          id: 16,
          grade1: 25,
          grade2: 30,
          rate: 4,
          value: 125,
          des: "好羡慕那些奖励多的|惊喜又感动|来这公司，我就是来对了|加班疲惫，瞬间治愈|入职时说的共赢，今年终于具象化|入职时HR说的家文化，今年信了|准备和公司再战十年|到手的厚度，快赶上新华字典了|实锤，老板家里有矿|老板真是豪爽|隔壁公司的小姐姐都馋哭了|我决定了，以后把公司当成家|老板不愧是老板|要不说老板怎么能当老板呢，就是不一样|内心的激动，无法用言语表达"
        },
        k17: {
          id: 17,
          grade1: 31,
          grade2: 36,
          rate: 50,
          value: 30,
          des: "幸福满满|这次年终奖可以称霸朋友圈|接着奏乐接着舞|快能实现财富自由了|准备回家给马桶镶个金边|董事长像极了财神爷|行业排名不是第一，但员工满意度是|没想到今年居然有这么多|太惊喜了|明年加班，我自带行军床|以后董事长说东，我绝不往西|这家公司的老板格局很大|明年我要加倍努力|这竟然不是梦|这样的董事长活该赚钱|何其有幸能入职这家公司|简直不敢相信|可以把购物车清空了|好感动|幸福来得太突然"
        },
        k18: {
          id: 18,
          grade1: 31,
          grade2: 36,
          rate: 25,
          value: 60,
          des: "幸福满满|这次年终奖可以称霸朋友圈|接着奏乐接着舞|快能实现财富自由了|准备回家给马桶镶个金边|董事长像极了财神爷|行业排名不是第一，但员工满意度是|没想到今年居然有这么多|太惊喜了|明年加班，我自带行军床|以后董事长说东，我绝不往西|这家公司的老板格局很大|明年我要加倍努力|这竟然不是梦|这样的董事长活该赚钱|何其有幸能入职这家公司|简直不敢相信|可以把购物车清空了|好感动|幸福来得太突然"
        },
        k19: {
          id: 19,
          grade1: 31,
          grade2: 36,
          rate: 10,
          value: 90,
          des: "幸福满满|这次年终奖可以称霸朋友圈|接着奏乐接着舞|快能实现财富自由了|准备回家给马桶镶个金边|董事长像极了财神爷|行业排名不是第一，但员工满意度是|没想到今年居然有这么多|太惊喜了|明年加班，我自带行军床|以后董事长说东，我绝不往西|这家公司的老板格局很大|明年我要加倍努力|这竟然不是梦|这样的董事长活该赚钱|何其有幸能入职这家公司|简直不敢相信|可以把购物车清空了|好感动|幸福来得太突然"
        },
        k20: {
          id: 20,
          grade1: 31,
          grade2: 36,
          rate: 5,
          value: 150,
          des: "幸福满满|这次年终奖可以称霸朋友圈|接着奏乐接着舞|快能实现财富自由了|准备回家给马桶镶个金边|董事长像极了财神爷|行业排名不是第一，但员工满意度是|没想到今年居然有这么多|太惊喜了|明年加班，我自带行军床|以后董事长说东，我绝不往西|这家公司的老板格局很大|明年我要加倍努力|这竟然不是梦|这样的董事长活该赚钱|何其有幸能入职这家公司|简直不敢相信|可以把购物车清空了|好感动|幸福来得太突然"
        }
      });
      a._RF.pop()
    }
  }
}));