System.register("chunks:///_virtual/ZGGSBookTxt.ts", ["cc"], (function(o) {
  "use strict";
  var s;
  return {
    setters: [function(o) {
      s = o.cclegacy
    }],
    execute: function() {
      s._RF.push({}, "259a4WZ4tBAb4/zJob0mcBb", "ZGGSBookTxt", void 0);
      o("ZGGSBookTxt", class {
        static gsColorByGradesg(o) {
          return [
            [0, 0, 0, ""],
            [52, 45, 43, "#342d2b"],
            [51, 170, 35, "#33AA23"],
            [19, 100, 204, "#1364CC"],
            [182, 19, 204, "#B613CC"],
            [214, 143, 17, "#D68F11"],
            [195, 39, 39, "#C32727"],
            [212, 175, 55, "#D4AF37"]
          ][o]
        }
        static gsColorByGradesg2(o) {
          return [
            [0, 0, 0, ""],
            [255, 255, 255, "#FFFFFF"],
            [51, 170, 35, "#33AA23"],
            [19, 100, 204, "#1364CC"],
            [182, 19, 204, "#B613CC"],
            [214, 143, 17, "#D68F11"],
            [195, 39, 39, "#C32727"],
            [212, 175, 55, "#D4AF37"]
          ][o]
        }
        static gsNorStringType(o) {
          return {
            1: "免费",
            2: "暂时还没有新邮件哦",
            3: "暂时还没有公告哦",
            4: "您确定要删除该邮件吗？删除后未领取的奖励消失。",
            5: "您确定要删除该告示吗？删除后未领取的奖励消失。",
            6: "ID:",
            7: "复制成功",
            8: "兑换码不能为空",
            9: "兑换码错误",
            10: "请输入正确的验证码",
            11: "请输入验证码: ",
            12: "兑换码奖励领取成功",
            13: "该兑换码奖励已领取",
            14: "游戏正在载入中，此过程不会消耗流量",
            15: "您的选择不对哦，请想清楚了再继续选择",
            16: "请输入1-12个汉字",
            17: "名字不能为空",
            18: "请输入中文",
            19: "请输入2-4个汉字",
            20: "包含非法字符，请重新输入",
            21: "名字不能有空格",
            22: "请输入1-2个汉字",
            23: "天",
            24: "暂未获得",
            25: "请输入1个汉字",
            26: "该字可能和姓氏组合成非法字符，请重新输入",
            27: "无",
            28: "已满"
          } [o]
        }
        static gsNorStringNum(o) {
          return {
            1: "垓",
            2: "京",
            3: "兆",
            4: "亿",
            5: "万",
            6: "秭",
            7: "穰",
            8: "沟",
            9: "涧",
            10: "正",
            11: "载",
            12: "极"
          } [o]
        }
        static gsRichTxtNeedAward(o = 1) {
          return [`<img src="${this.gsAwardImg(o)}"/>`, `<img src="${this.gsAwardImg2(o)}"/>`]
        }
        static gsNeedAward(o) {
          return ["", "钞票", "钻石", "金卡", "公司实力"][o] || ""
        }
        static gsAwardImg(o) {
          return {
            0: "",
            1: "xqq1",
            2: "xqq2",
            3: "xqq3",
            4: "xqq4"
          } [o]
        }
        static gsAwardImg2(o) {
          return {
            0: "",
            1: "xqq1a",
            2: "xqq2a",
            3: "xqq3a",
            4: "xqq4a"
          } [o]
        }
        static gsStringByParam(o, s) {
          return {
            1: `<color=#181818>${s}</color>`,
            2: `<color=#FFFFFF>${s}</color>`,
            3: `${s}级`,
            4: `${s}`,
            5: `${s}%`,
            6: `/${s}`,
            7: `-${s}`,
            8: `lv${s}`,
            9: `需公司满${s}人`,
            10: `第${s}期培训`,
            11: `[x${s}]`,
            12: `本月共有${s}人职级上升`,
            13: `上月共有${s}人职级跨阶，可举办升职宴`,
            14: `年终将至，为感谢全体${s}位同事的努力`,
            15: `可${s}天提升学历`,
            16: `${s}撤销了离职申请`,
            17: `${s}去意已决，拒绝谈判挽留`,
            18: `${s}离开了公司`,
            19: `${s}位公司人员赚钱能力得到提升`,
            20: `${s}分钟`,
            21: `需${s}天`,
            22: `学成后董事长赚钱能力+${s}/月`,
            23: `需公司满${s}人`,
            24: `员工${s}申请离职创业`,
            25: `员工${s}即将开始创业`,
            26: `${s}个月后可收取回报`,
            27: `天使投资的${s}公司进一步扩张`,
            28: `公司等级由${s}→`,
            29: `公司人数由${s}人→`,
            30: `公司每月收入由${s}→`,
            31: `公司现金流由${s}→`,
            32: `对${s}注资成功，公司得到进一步扩张`,
            33: `每半年预计增加获得${s}倍投资回报`,
            34: `员工${s}与对象得到爱情的结晶`,
            35: "",
            36: "",
            101: `${s}/月`,
            102: `+${s}/天`,
            103: `恭喜公司满${s}人`,
            104: `包含${s}位员工`,
            105: `调配${s}位员工`,
            106: `公司满${s}人后，该位置解锁`,
            107: `请先挑战[${s}]获胜`,
            108: `共${s}人参与`,
            109: `${s}人参与`,
            110: `本次团建，有${s}人最为耀眼`,
            111: `x${s}倍速`,
            112: `于${s}达成`,
            113: `公司实力<img src="xqq4"/>+${s}`,
            114: `+${s}天工作经验`,
            115: `${s}项补贴`,
            116: `${s}天后可完成`,
            117: `${s}级超能力`,
            118: `当前${s}倍速`,
            119: `董事长进行第${s}季度面谈`,
            120: `工作经验+${s}`,
            121: `${s}位公司人员获得大量工作经验`,
            122: `每月最多可进行${s}次招聘`,
            201: `+${s}%`,
            202: `工作经验+${s}/天`,
            203: `公司满${s}人后解锁`,
            204: `公司满${s}人后,该部门成立`,
            301: `潜力+${s}`,
            302: `事业心+${s}`,
            303: `+${s}%`,
            304: `${s}人`,
            305: `${s}`,
            306: `+${s}`,
            307: `对应人员事业心+${s}`,
            308: `${s}次`,
            309: `${s}期`
          } [o]
        }
        static gsStringByTwo(o) {
          return {
            1: "<color=%s>%s</color>",
            2: "%s~%s",
            3: "本月支出%s，赚钱%s，当前剩余%s",
            4: "本月支出%s，赚钱%s，当前剩余%s，<color=#C32727>已不足发放6个月的薪资</color>",
            5: "人员%s：%s",
            6: "%s位公司人员   事业心%s ",
            7: {
              title: "领袖沙龙活动奖励",
              content: "感谢参与领袖沙龙活动，给予建议和支持，特发以下奖励"
            },
            8: {
              1: "每季度随机%s名员工情绪稳定[生命]+%s~%s",
              2: "每季度随机%s名员工专业能力[攻击]+%s~%s",
              3: "每季度随机%s名员工抗压能力[防御]+%s~%s",
              4: "每季度随机%s名员工自我激励[速度]+%s~%s",
              5: "每季度随机%s名员工潜力+%s~%s",
              6: "每季度随机%s名员工事业心+%s~%s"
            },
            9: {
              1: "%s位员工情绪稳定[生命]+%s",
              2: "%s位员工专业能力[攻击]+%s",
              3: "%s位员工抗压能力[防御]+%s",
              4: "%s位员工自我激励[速度]+%s",
              5: "%s位员工潜力+%s",
              6: "%s位员工事业心+%s"
            },
            10: "",
            101: "(%s/%s)",
            102: "%s/%s",
            103: "因%s满%s人",
            104: "%s系列（已获得%s/%s个）",
            105: "公司满%s人后开放功能[%s]",
            106: "当前公司共%s人，游戏内1天相当于现实世界%s秒",
            107: "已安排人员数量不足",
            108: "未提供任何补贴",
            109: "最少需安排1位人员",
            110: "员工正在出差中，暂时无法辞退",
            111: "员工正在深造中，暂时无法辞退",
            112: "已加速时间",
            201: ""
          } [o]
        }
        static gsStringHelpIn(o) {
          return {
            1: {
              1: "办公场所",
              2: "员工班车",
              3: "管理用车",
              4: "秘书住房",
              5: "董事专属"
            },
            2: "公司名称仅支持中文，最多12个汉字",
            3: {
              1: {
                tit: "获赞日报",
                res: "日报奖励结果"
              },
              2: {
                tit: "获赞周报",
                res: "周报奖励结果"
              },
              3: {
                tit: "获赞月报",
                res: "月报奖励结果"
              }
            },
            4: {
              1: {
                tit: "即将破产",
                des1: "超过全员薪水x3倍",
                des2: "超过全员薪水x10倍时，将强制破产"
              },
              2: {
                tit: "强制破产",
                des1: "超过全员薪水x10倍",
                des2: "强制破产，可重新开始发展"
              }
            },
            5: {
              1: "年",
              2: "月"
            },
            6: "已满",
            7: {
              1: {
                des1: "潜力越高，赚钱能力+的越多",
                des2: "当前潜力%s，赚钱能力+%s/天"
              },
              2: {
                des1: "事业心越高，工作经验+的越多",
                des2: "当前事业心%s，工作经验+%s/天"
              }
            },
            8: {
              1: "另，所有下级赚钱能力+%s%",
              2: "另，董事长赚钱能力+%s%",
              3: "另，所有人员赚钱能力+%s%"
            },
            9: {
              0: "甲",
              1: "乙",
              2: "丙",
              3: "丁"
            },
            10: {
              1: "阳光普照奖",
              2: "优秀新人奖",
              3: "最佳进步奖",
              4: "杰出贡献奖",
              5: "战略突破奖",
              6: "董事长特别嘉奖"
            },
            11: "凭亿近人马老师|福报连绵马老师|普通家庭马老师|亿表人才‌马老师|抓手仙人马老师|赋能天尊马老师".split("|"),
            12: "您确定要辞退该员工吗？辞退后，将给与该员工一定补偿，该员工将无法找回，同时，对应岗位可重新招聘新的员工。",
            13: {
              0: "未上市",
              1: "上市"
            },
            100: {
              1: "暂停中",
              2: "进行中",
              3: "%s年%s月%s日"
            },
            101: {
              1: "招聘员工",
              2: "招聘管理",
              3: "招聘秘书",
              4: "引入董事"
            },
            102: {
              1: ["新的部门", "新的部门成立"],
              3: ["秘书处", "秘书处成立"],
              4: ["董事会", "董事会成立"]
            },
            103: {
              2: ["管理岗位事业心有额外加成", "→所有下级赚钱能力+%s%"],
              3: ["董事长秘书岗位事业心有额外加成", "→董事长赚钱能力+%s%"],
              4: ["董事岗位事业心有额外加成", "→全员赚钱能力+%s%"]
            },
            104: {
              hp: "情绪稳定\n[生命]+%s",
              att: "专业能力\n[攻击]+%s",
              def: "抗压能力\n[防御]+%s",
              speed: "自我激励\n[速度]+%s"
            },
            105: [
              ["赚钱能力", "赚钱能力", "+%s/天"],
              ["潜力", "潜力", "%s"],
              ["事业心", "事业心", "%s"],
              ["四维", "四维之和", "%s"],
              ["薪资", "薪资", "%s/月"]
            ],
            106: {
              1: "会员卡",
              2: "智能手机",
              3: "智能手表",
              4: "日常用品",
              5: "食品礼盒",
              6: "酒水礼盒",
              7: "茶叶礼盒",
              8: "黄金礼盒"
            },
            107: {
              1: ["应聘岗位", "引入岗位"],
              2: ["要求薪资", "承诺薪资"],
              3: ["签约", "引入"]
            },
            108: ["为了争夺更多的市场份额", "为了保护最为核心的技术", "为了突破核心技术的封锁", "为了争夺资源定价权", "为了解决合同纠纷", "为了应对政策的突然变化", "为了争夺行业标准主导权", "因为对方的甲方爸爸改需求", "因为我方董事长的一个拍脑门想法", "因为合同漏洞比脸大", "因为对方抢客户", "因为对方用开水浇我方发财树"],
            109: ["因合作伙伴来访", "有潜在客户来考察公司实力"],
            110: ["因拜访客户", "因推进项目进度", "因业务拓展", "为处理供应商关系", "为调查市场需求", "为开拓新市场", "为签订重要合同", "为寻求技术支持", "为拿下对方老总", "为搞好合作关系", "为提升产品利润", "为了抱上粗大腿"],
            111: ["全球智造者联盟峰会", "亚太经济领袖论坛", "高级决策者云端峰会", "新世界资本之巅闭门会", "东方数字货币圆桌会议", "全球商机对接峰会", "亚太供应链转型论坛", "全球画饼技术鉴定峰会", "产业链协同发展峰会", "新世界制造生态伙伴大会", "品牌出海战略研讨峰会", "IP商业化战略峰会", "去中心化经济生态峰会", "数据主权安全峰会", "科学突破与产业转化峰会", "品牌全球化战略峰会"],
            112: ["因为同事之间责任相互推诿", "因为工作负荷过重", "因为工作环境比较压抑", "因为工作成果不被领导认可", "因为被领导骂了个狗血淋头", "因为上级领导给的承诺未兑现", "因为不满上级领导打出的绩效评估", "因为晋升通道不透明", "因为上级领导要求自己背锅", "因为被同事穿小鞋"],
            201: "",
            202: {
              1: "第一天",
              2: "第二天",
              3: "第三天",
              4: "第四天",
              5: "第五天",
              6: "第六天",
              7: "第七天"
            },
            203: {
              1: "中部地区",
              2: "东部地区",
              3: "南部地区",
              4: "西部地区",
              5: "北部地区"
            },
            204: {
              1: "工作经验",
              2: "情绪稳定[生命]",
              3: "专业能力[攻击]",
              4: "抗压能力[防御]",
              5: "自我激励[速度]"
            },
            205: {
              1: "情绪稳定[生命+]",
              2: "专业能力[攻击+]",
              3: "抗压能力[防御+]",
              4: "自我激励[速度+]"
            },
            206: {
              1: "情绪稳定[生命]",
              2: "专业能力[攻击]",
              3: "抗压能力[防御]",
              4: "自我激励[速度]"
            }
          } [o]
        }
        static gsStringJDInfo() {
          return ["进度条文本"]
        }
        static gsStringSortInfo(o, s, t = null) {
          let r = {
            1: "",
            100: {
              1: "按四维从高到低排序",
              2: "按职级从高到低排序",
              3: "按潜力从高到低排序",
              4: "按事业心从高到低排序"
            }
          };
          return t ? r[o][s][t] : r[o][s]
        }
        static gsWinStringHelp() {
          return {}
        }
        static gsYDStringHelp() {
          return {
            1: "欢迎来到%s，一个新星的公司即将崛起，日后定会成为行业瞩目的未来之星......",
            2: "公司发展是<color=#C32727>按天自动推进</color>的！",
            3: "随着时间的推进，会<color=#C32727>随机触发事件</color>。",
            4: "现在，请点击按钮，使时间从<color=#C32727>暂停中</color>变为<color=#C32727>进行中</color>！",
            5: "收到一份简历，但是这位求职者，有点不太靠谱的样子，点击重新随机试试吧。（<color=#C32727>本次免费</color>）",
            6: "现在这位求职者，感觉靠谱多了，日后定会为公司的发展做出巨大贡献。",
            7: "作为第一个公司员工，必须隆重欢迎一下！（<color=#C32727>本次免费</color>）",
            8: "又收到一份简历，但是这位求职者，好像也不太靠谱，点击重新随机试试吧。（<color=#C32727>本次免费</color>）",
            9: "现在这位求职者，就非常靠谱了，日后也定会为公司的发展做出巨大贡献。",
            10: "再隆重欢迎一下我们第二位员工！（<color=#C32727>本次免费</color>）",
            11: "现在，来查看一下公司现有的办公设备！",
            12: "给董事长配备办公设备，可增加董事长<color=#C32727>每天获得的工作经验</color>（游戏中，工作经验每天自动增加）",
            13: "先来配备办公电脑！（<color=#C32727>本次免费</color>）",
            14: "接下来配备办公桌。（<color=#C32727>本次免费</color>）",
            15: "再来配备办公椅！（<color=#C32727>本次免费</color>）",
            16: "公司的发展离不开市场的开发，再来查看一下当前的市场状况！",
            17: "公司目前处于发展阶段，只能先进行中部地区-工业走廊城市的市场调研！",
            18: "安排进行市场调研的人员，<color=#C32727>每天可以获得更多的工作经验</color>，目前可安排1人。",
            19: "点击这里可一键安排公司成员！",
            20: "随着公司不断的发展壮大，<color=#C32727>公司人员不断增加</color>时，会解锁<color=#C32727>新的功能</color>如<color=#C32727>考核、商战、出差</color>等，同时也会触发<color=#C32727>随机事件</color>如<color=#C32727>培训、获赞日报、员工摸鱼</color>等",
            21: "当公司人员达到一定时，公司<color=#C32727>会成立新的部门</color>，或者某个部门人员达到一定时，会<color=#C32727>拆分成多个部门</color>！",
            22: "业务部成立后，在招聘时可能会招聘到主管类人才，来管理下级员工！（<color=#C32727>主管对下级员工的赚钱能力会有加成哦</color>！）",
            23: "因公司实力持续增加，可以提升公司评价啦！",
            24: "可以观看视频获得3倍奖励！（<color=#C32727>本次免费</color>）",
            25: "秘书处成立，公司可以招聘董事长秘书了！",
            26: "秘书处成立后，在招聘时可能会招聘到董事长秘书！（<color=#C32727>董事长秘书对董事长的赚钱能有会有加成哦！</color>）",
            27: "这里是第1个员工的工位",
            28: "这里是第2个员工的工位"
          }
        }
        static gsFaceVido(o, s) {
          if (!s) return null;
          let t = s.img;
          return [305, 310, 311].indexOf(s.id) >= 0 ? `t${t}` : 1 == o ? `b${t}` : 2 == o ? `g${t}` : null
        }
        static dbtZongName(o, s) {
          return {
            1: {
              1: "赞助_钞票",
              2: "赞助_钻石",
              3: "赞助_金卡",
              4: "评价_3倍",
              5: "成就_3倍",
              "6_1": "签到_双倍_1",
              "6_2": "签到_双倍_2",
              "6_3": "签到_双倍_3",
              "6_4": "签到_双倍_4",
              "6_5": "签到_双倍_5",
              "6_6": "签到_双倍_6",
              "6_7": "签到_双倍_7",
              7: "事件_喜宴请柬",
              8: "事件_超能力",
              9: "事件_情绪爆发",
              10: "事件_季度面谈",
              11: "事件_推荐书籍",
              12: "事件_导师点拨",
              13: "破产_领取救济",
              14: "离线收益_x2倍",
              15: "事件_充电",
              16: "事件_投资",
              17: "事件_追加投资",
              18: "事件_员工生娃"
            },
            2: {
              1: "事件_部门事件",
              2: "事件_出差",
              "3_1": "事件_获赞日报",
              "3_2": "事件_获赞周报",
              "3_3": "事件_获赞月报",
              4: "事件_奖金激励",
              5: "考核升级",
              6: "事件_末位淘汰",
              7: "事件_年终奖",
              8: "事件_培训",
              9: "事件_商务接待",
              10: "设备解锁",
              11: "设备升级",
              12: "事件_升职宴",
              13: "事件_深造",
              14: "市场提升",
              15: "事件_团建",
              16: "事件_外出驻场",
              17: "资产解锁",
              18: "资产升级",
              19: "事件_招聘员工",
              20: "事件_隆重欢迎",
              21: "发放薪水",
              22: "事件_充电",
              23: "辞退员工",
              24: "时间加速",
              25: "福利升级"
            },
            3: {
              1: "赞助",
              2: "事件_部门事件",
              3: "成就奖励",
              4: "事件_行业峰会",
              5: "离线收益",
              6: "评价福利",
              7: "破产_领取救济",
              8: "签到",
              9: "事件_商业谈判",
              10: "商战",
              11: "员工获取",
              12: "侧边栏奖励",
              13: "桌面奖励",
              14: "投资回报"
            },
            4: {
              1: "评价",
              2: "年数分布",
              3: "公司成员分布"
            },
            5: {
              1: "设备",
              2: "市场",
              3: "资产",
              4: "考核",
              5: "商战",
              6: "出差",
              7: "深造",
              8: "排名",
              9: "充电"
            },
            6: {
              1: "签到",
              2: "离线",
              3: "成就",
              4: "赞助"
            },
            7: {
              1: {
                tit: "事件_深造",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              2: {
                tit: "事件_外出驻场",
                choose: {
                  1: "换一批",
                  2: "安排"
                }
              },
              3: {
                tit: "事件_奖金激励",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              4: {
                tit: "事件_商业谈判",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              "5_1": {
                tit: "事件_招聘员工",
                choose: {
                  1: "重新随机",
                  2: "签约",
                  3: "关闭"
                }
              },
              "5_2": {
                tit: "事件_招聘管理",
                choose: {
                  1: "重新随机",
                  2: "签约",
                  3: "关闭"
                }
              },
              "5_3": {
                tit: "事件_招聘秘书",
                choose: {
                  1: "重新随机",
                  2: "签约",
                  3: "关闭"
                }
              },
              "5_4": {
                tit: "事件_招聘董事",
                choose: {
                  1: "重新随机",
                  2: "签约",
                  3: "关闭"
                }
              },
              6: {
                tit: "事件_培训",
                choose: {
                  1: "关闭",
                  2: "开始"
                }
              },
              7: {
                tit: "事件_团建",
                choose: {
                  1: "",
                  2: ""
                }
              },
              8: {
                tit: "事件_出差",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              9: {
                tit: "事件_升职宴",
                choose: {
                  1: "",
                  2: ""
                }
              },
              10: {
                tit: "事件_商业接待",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              12: {
                tit: "事件_行业峰会",
                choose: {
                  1: "放弃",
                  2: "进行"
                }
              },
              13: {
                tit: "事件_欢迎同事",
                choose: {
                  1: "简单欢迎",
                  2: "隆重欢迎"
                }
              },
              14: {
                tit: "事件_部门事件",
                choose: {
                  1: "",
                  2: ""
                }
              },
              "15_1": {
                tit: "事件_获赞日报",
                choose: {
                  1: "口头奖励",
                  2: "实质奖励"
                }
              },
              "15_2": {
                tit: "事件_获赞周报",
                choose: {
                  1: "口头奖励",
                  2: "实质奖励"
                }
              },
              "15_3": {
                tit: "事件_获赞月报",
                choose: {
                  1: "口头奖励",
                  2: "实质奖励"
                }
              },
              16: {
                tit: "事件_员工摸鱼",
                choose: {
                  1: "敲打",
                  2: "没看见"
                }
              },
              17: {
                tit: "事件_申请加薪",
                choose: {
                  1: "拒绝",
                  2: "进行"
                }
              },
              18: {
                tit: "事件_结婚宴请",
                choose: {
                  1: "谢绝",
                  2: "视频"
                }
              },
              19: {
                tit: "事件_岗位调整",
                choose: {
                  1: "拒绝",
                  2: "进行"
                }
              },
              20: {
                tit: "事件_员工离职",
                choose: {
                  1: "加薪",
                  2: "同意"
                }
              },
              21: {
                tit: "事件_推荐书籍",
                choose: {
                  1: "进行",
                  2: "视频"
                }
              },
              22: {
                tit: "事件_年终奖",
                choose: {
                  1: "放弃",
                  2: "按方案进行"
                }
              },
              23: {
                tit: "事件_末位淘汰",
                choose: {
                  1: "放弃",
                  2: "淘汰"
                }
              },
              25: {
                tit: "事件_情绪爆发",
                choose: {
                  1: "普通",
                  2: "视频"
                }
              },
              26: {
                tit: "事件_导师点拨",
                choose: {
                  1: "普通",
                  2: "视频"
                }
              },
              27: {
                tit: "事件_季度面谈",
                choose: {
                  1: "普通",
                  2: "视频"
                }
              },
              28: {
                tit: "事件_超能力",
                choose: {
                  1: "普通",
                  2: "视频"
                }
              },
              29: {
                tit: "事件_充电",
                choose: {
                  1: "报名",
                  2: "拉满",
                  3: "关闭"
                }
              }
            }
          } [o][s]
        }
      }), s._RF.pop()
    }
  }
}));